## Staging: s3_scan_object
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                              NAME                               |
|--------|-----------------------------------------------------------------|
| add    | `aws_lambda_event_source_mapping.sqs_s3_events[&quot;239043911459&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lambda_event_source_mapping.sqs_s3_events["239043911459"] will be created
  + resource "aws_lambda_event_source_mapping" "sqs_s3_events" {
      + enabled                       = true
      + event_source_arn              = "arn:aws:sqs:ca-central-1:239043911459:s3-scan-object"
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:ca-central-1:127893201980:function:s3-scan-object"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config {
          + consumer_group_id = (known after apply)
        }

      + self_managed_kafka_event_source_config {
          + consumer_group_id = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
